html/apue/file_io.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>文件I/O</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="klose" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="standard.html"> UP </a>
 |
 <a accesskey="H" href="apue.html"> HOME </a>
</div><div id="content">
<h1 class="title">文件I/O</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">文件描述符</a>
<ul>
<li><a href="#sec-1-1">shell</a></li>
<li><a href="#sec-1-2">常量定义</a></li>
<li><a href="#sec-1-3">设备文件</a></li>
</ul>
</li>
<li><a href="#sec-2">open函数</a>
<ul>
<li><a href="#sec-2-1">oflag参数</a></li>
<li><a href="#sec-2-2">文件名截短　</a></li>
<li><a href="#sec-2-3">返回的文件描述符</a></li>
</ul>
</li>
<li><a href="#sec-3">creat函数</a></li>
<li><a href="#sec-4">close函数</a></li>
<li><a href="#sec-5">lseek函数</a>
<ul>
<li><a href="#sec-5-1">off_t</a></li>
<li><a href="#sec-5-2">参数</a></li>
<li><a href="#sec-5-3">返回值</a>
<ul>
<li><a href="#sec-5-3-1">测试是否支持文件偏移</a></li>
<li><a href="#sec-5-3-2">文件空洞</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">read函数</a></li>
<li><a href="#sec-7">write函数</a></li>
<li><a href="#sec-8">I/O的效率</a></li>
</ul>
</div>
</div>
<p>
大多数UNIX文件I/O只需用到5个函数：open、read、write、lseek以及close。这些函数经常被称之为不带缓存的I/O，指的是每个read和write都调用内核中的一个系统调用。然后说明不同缓存器长度对read和write函数的影响
</p>

<p>
接着将通过传送给open函数的参数来讨论原子操作这个概念，以及在多个进程间如何共享文件，并涉及内核的有关数据结构
</p>

<p>
最后将说明dup、fcntl和ioctl函数
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">文件描述符</h2>
<div class="outline-text-2" id="text-1">
<p>
对于内核而言，所有打开文件都由文件描述符引用。文件描述符是一个非负整数。当打开一个现存文件或创建一个新文件时，内核向进程返回一个文件描述符。当读、写一个文件时，用open或creat返回的文件描述符标识该文件，将其作为参数传送给read或write
</p>

<p>
文件描述符的范围是0~OPEN_MAX
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">shell</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>文件描述符0与进程的标准输入相结合
</li>
<li>文件描述符1与标准输出相结合
</li>
<li>文件描述符2与标准出错输出相结合
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">常量定义</h3>
<div class="outline-text-3" id="text-1-2">
<p>
在&lt;unistd.h&gt;中定义以下常量来标识标准文件描述符
</p>
<ul class="org-ul">
<li>STDIN_FILENO:  0
</li>
<li>STDOUT_FILENO: 1
</li>
<li>STDERR_FILENO: 2
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">设备文件</h3>
<div class="outline-text-3" id="text-1-3">
<p>
标准输入、标准输出和标准出错对应的设备文件注册在目录/dev中，文件名分别为stdin.stdout,stderr。它们实际上分别是指向/proc/self/fd/0,/proc/self/fd/1,/proc/self/fd/2的软链接
</p>
<div class="org-src-container">

<pre class="src src-sh">$ cd /dev/
/dev $ ls -l std*

lrwxrwxrwx 1 root root 15 Jan 20  2017 stderr -&gt; /proc/self/fd/2
lrwxrwxrwx 1 root root 15 Jan 20  2017 stdin -&gt; /proc/self/fd/0
lrwxrwxrwx 1 root root 15 Jan 20  2017 stdout -&gt; /proc/self/fd/1
</pre>
</div>

<p>
虚拟目录/proc/self/fd中记录了当前进程所打开的文件描述符。可以看到在xfce4-terminal中，实际文件描述符指向/dev/pts/虚拟字符设备
</p>
<div class="org-src-container">

<pre class="src src-sh">/proc/self/fd $ ls -l

total 0
lrwx------ 1 klose klose 64 Jan 19 21:54 0 -&gt; /dev/pts/0
lrwx------ 1 klose klose 64 Jan 19 21:54 1 -&gt; /dev/pts/0
lrwx------ 1 klose klose 64 Jan 19 21:54 2 -&gt; /dev/pts/0
lrwx------ 1 klose klose 64 Jan 19 22:20 255 -&gt; /dev/pts/0
</pre>
</div>
<p>
对于守护进程，　0、1、2都是链接到/dev/null的，这说明守护进程不会跟任何的接口进行交互！
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">open函数</h2>
<div class="outline-text-2" id="text-2">
<p>
以oflag指定的方式打开字符串filename指定的文件
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;fcntl.h&gt;</span>
<span style="color: #ff4500;">/** </span><span style="color: #ff4500;">&#12288;</span>
<span style="color: #ff4500;">  &#25171;&#24320;&#25991;&#20214;</span>

<span style="color: #ff4500;">  filename: &#25991;&#20214;&#21517;</span>
<span style="color: #ff4500;">  oflag: &#25171;&#24320;&#36873;&#39033;&#65292;&#20363;&#22914;O_RDWR | O_APPEND</span>

<span style="color: #ff4500;">  mode_t: &#21487;&#36873;&#25321;&#21442;&#25968;&#65292;&#24403;oflag&#21253;&#21547;O_CREAT&#30340;&#26102;&#20505;&#65292;&#34920;&#31034;&#21019;&#24314;&#25991;&#20214;&#30340;&#26435;&#38480;</span>

<span style="color: #ff4500;">  &#25104;&#21151;&#26102;&#36820;&#22238;&#23545;&#24212;&#30340;&#25991;&#20214;&#25551;&#36848;&#31526;</span>
<span style="color: #ff4500;">  &#22833;&#36133;&#26102;&#36820;&#22238;-1&#65292;&#24182;&#35774;&#32622;errorno&#25351;&#20195;&#22833;&#36133;&#21407;&#22240;  </span>
<span style="color: #ff4500;"> </span><span style="color: #ff4500;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">open</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">filename</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">oflag</span>, ...<span style="color: #ff4500;">/* </span><span style="color: #ff4500;">mode_t mode </span><span style="color: #ff4500;">*/</span>);
</pre>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">oflag参数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
oflag参数必须指定且只指定下面中的一个
</p>
<ol class="org-ol">
<li>O_RDONLY：只读打开
</li>
<li>O_WRONLY：只写打开
</li>
<li>O_RDWR：读、写打开
</li>
</ol>

<p>
可选参数：
</p>
<ul class="org-ul">
<li>O_APPEND：每次写时都加到文件的尾端
</li>
<li>O_CREAT：若此文件不存在则创建它，使用此选择项时，需同时说明第三个参数mode用其说明该新文件的权限
</li>
<li>O_EXCL：如果同时指定了O_CREAT，而文件已经存在则出错。用来测试一个文件是否存在，如果不存在则创建此文件成为一个原子操作
</li>
<li>O_TRUNC：如果此文件存在，而且为只读或只写成功打开，否则将其长度截短为0
</li>
<li>O_NOCTTY：如果pathname指的是终端设备，则不将此设备分配作为此进程的控制终端
</li>
<li>O_NONBLOCK：如果pathname指的是一个FIFO、一个块特殊文件或一个字符特殊文件，则此选择项为此文件的本次打开操作和后续的I/O操作设置非阻塞方式
</li>
<li>O_SYNC：使每次write都等到物理I/O操作完成
</li>
</ul>

<p>
这些常数定义在&lt;fcntl.h&gt;头文件中
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">文件名截短　</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>若_POSIX_NO_TRUNC有效，则在整个路径名超过PATH_MAX，或路径名中的任一文件名超过NAME_MAX时，返回出错ENAMETOOLONG
</li>
<li>反之，文件名会被截断到最大字符数
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">返回的文件描述符</h3>
<div class="outline-text-3" id="text-2-3">
<p>
由open返回的文件描述符一定是最小的未用描述符数字。这一点被很多应用程序用来在标准输入、标准输出或标准出错输出上打开一个新的文件。例如，一个应用程序可以先关闭标准输出(通常是文件描述符1)，然后打开另一个文件，该文件一定会在文件描述符1上打开 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">creat函数</h2>
<div class="outline-text-2" id="text-3">
<p>
创建一个新的文件
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/types.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/stat.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;fcntl.h&gt;</span>

<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#20197;&#21482;&#20889;&#24418;&#24335;&#25171;&#24320;&#19968;&#20010;&#26032;&#30340;&#25991;&#20214;</span>

<span style="color: #ffa07a;">   filename&#65306;&#25991;&#20214;&#21517;</span>
<span style="color: #ffa07a;">   mode&#65306;&#25991;&#20214;&#26435;&#38480;</span>

<span style="color: #ffa07a;">   &#33509;&#25104;&#21151;&#36820;&#22238;&#25171;&#24320;&#30340;&#25991;&#20214;&#25551;&#36848;&#31526;</span>
<span style="color: #ffa07a;">   &#33509;&#20986;&#38169;&#36820;&#22238;-1</span>
<span style="color: #ffa07a;">  */</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">creat</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">filename</span>, <span style="color: #98fb98;">mode_t</span> <span style="color: #eedd82;">mode</span>);
</pre>
</div>
<p>
以只写方式创建并打开一个新文件，如果文件已存在，则文件被截短为0。事实上creat函数等价于下面的open调用
</p>
<div class="org-src-container">

<pre class="src src-C">open(<span style="color: #ffa07a;">"filename"</span>, O_WRONLY | O_TRUNC | O_CREAT,mode);
</pre>
</div>
<p>
creat的一个不足之处是以只写方式打开所创建的文件。当初如果要创建一个临时文件，并要先写该文件，然后又读该文件，则必须先调用creat,close,然后再调用open。最新的open可以这样做
</p>
<div class="org-src-container">

<pre class="src src-C">open(<span style="color: #ffa07a;">"filename"</span>, O_RDWR | O_TRUNC | O_CREAT,mode);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">close函数</h2>
<div class="outline-text-2" id="text-4">
<p>
关闭一个打开文件，如果成功返回0，如果失败返回-1 
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;unistd.h&gt;</span>
<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;"> &#20851;&#38381;&#25991;&#20214;</span>

<span style="color: #ffa07a;"> filedes&#65306;&#25991;&#20214;&#25551;&#36848;&#31526;</span>

<span style="color: #ffa07a;"> &#25104;&#21151;&#36820;&#22238;0</span>
<span style="color: #ffa07a;"> &#22833;&#36133;&#36820;&#22238;-1</span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">close</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">filedes</span>);
</pre>
</div>
<p>
关闭文件的时候如果进程在此文件上加有记录锁，则将释放所有记录锁。
</p>

<p>
关闭进程会关闭所有打开的文件描述符，所以close函数往往不会被显示调用
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">lseek函数</h2>
<div class="outline-text-2" id="text-5">
<p>
设置文件指针的位置
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;unistd.h&gt;</span>
<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#35774;&#32622;&#25991;&#20214;&#25351;&#38024;&#30340;&#20301;&#32622;</span>

<span style="color: #ffa07a;">   filedes&#65306;&#25991;&#20214;&#25551;&#36848;&#31526;</span>
<span style="color: #ffa07a;">   offset&#65306;&#25991;&#20214;&#20301;&#32622;&#20559;&#31227;&#37327;&#65292;&#21333;&#20301;&#26159;&#23383;&#33410;&#25968;</span>
<span style="color: #ffa07a;">   whence&#65306;&#20174;&#21738;&#37324;&#24320;&#22987;&#35745;&#31639;&#20559;&#31227;&#37327;</span>

<span style="color: #ffa07a;">   &#25104;&#21151;&#26102;&#36820;&#22238;0</span>
<span style="color: #ffa07a;">   &#22833;&#36133;&#26102;&#36820;&#22238;-1&#65292;&#24182;&#35774;&#32622;errorno</span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">off_t</span> <span style="color: #87cefa;">lseek</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">filedes</span>, <span style="color: #98fb98;">off_t</span> <span style="color: #eedd82;">offset</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">whence</span>);
</pre>
</div>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">off_t</h3>
<div class="outline-text-3" id="text-5-1">
<p>
off_t通常定义为一个word的长度，32位机器是long类型，4个byte长度
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">参数</h3>
<div class="outline-text-3" id="text-5-2">
<p>
对参数offset的解释与参数whence的值有关:
</p>
<ul class="org-ul">
<li>若whence是SEEK_SET，则将该文件的位移量设置为距文件开始处offset个字节。offset为非负
</li>
<li>若whence是SEEK_CUR，则将该文件的位移量设置为其当前值加offset。offset可为正或负
</li>
<li>若whence是SEEK_END，则将该文件的位移量设置为文件长度加offset。offset可为正或负
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">返回值</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>成功时将返回相对于文件开始处的偏移量(可能是负数)
</li>
<li>失败返回-1，并设置errno
</li>
</ul>

<p>
因为lseek可以返回负数，所以判断lseek是否执行成功，最好用返回值是否为-1来进行判断
</p>
</div>
<div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1">测试是否支持文件偏移</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
在文件是FIFO、管道或者套接字时，lseek将失败并设置errno为ESPIPE(Illegal seek)
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/types.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;unistd.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;stdio.h&gt;</span> 
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;stdlib.h&gt;</span>

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">void</span>) 
{
    <span style="color: #00ffff;">if</span>(lseek(STDIN_FILENO, 0, SEEK_CUR) == -1) 
        printf(<span style="color: #ffa07a;">"can not seek \n"</span>);
    <span style="color: #00ffff;">else</span> 
        printf(<span style="color: #ffa07a;">"seek OK \n"</span>); 

    exit(EXIT_SUCCESS);

}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2">文件空洞</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
文件位移量可以大于文件的当前长度,在这种情况下,对该文件的下一次写将延长该文件，并在文件中构成一个空调,这一点是允许的。位于文件中但没有写过的字节都被读为0
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/types.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;sys/stat.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;fcntl.h&gt;</span>
<span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">"apue.h"</span>


<span style="color: #98fb98;">char</span> <span style="color: #eedd82;">buf1</span>[] = <span style="color: #ffa07a;">"abcdefghij"</span>;
<span style="color: #98fb98;">char</span> <span style="color: #eedd82;">buf2</span>[] = <span style="color: #ffa07a;">"ABCDEFGHIJ"</span>;

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">void</span>) 
{
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fd</span>; 

    <span style="color: #00ffff;">if</span>((fd = creat(<span style="color: #ffa07a;">"file.hole"</span>, FILE_MODE)) &lt; 0) 
        err_sys(<span style="color: #ffa07a;">"creat error"</span>);

    <span style="color: #00ffff;">if</span>(write(fd, buf1, 10) != 10) 
        err_sys(<span style="color: #ffa07a;">"buf1 write error"</span>); 
    <span style="color: #ff4500;">/* </span><span style="color: #ff4500;">offset now 10</span><span style="color: #ff4500;">*/</span>
    <span style="color: #00ffff;">if</span>(lseek(fd, 40, SEEK_SET) == -1)
        err_sys(<span style="color: #ffa07a;">"seek error"</span>); 
    <span style="color: #ff4500;">/* </span><span style="color: #ff4500;">offset now 40 </span><span style="color: #ff4500;">*/</span>
    <span style="color: #00ffff;">if</span>(write(fd, buf2, 10) != 10) 
        err_sys(<span style="color: #ffa07a;">"buf2 write error"</span>); 
    <span style="color: #ff4500;">/* </span><span style="color: #ff4500;">offset now 50 </span><span style="color: #ff4500;">*/</span>

    exit(0);
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">read函数</h2>
<div class="outline-text-2" id="text-6">
<p>
从打开文件中读取数据到缓存区中
</p>

<p>
如果成功读取，在返回前当前文件的偏移量会加上读取的真实字节数
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;unistd.h&gt;</span>

<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#20174;filedes&#25991;&#20214;&#30340;&#24403;&#21069;&#20301;&#32622;&#35835;&#21462;nbytes&#23383;&#33410;&#21040;&#32531;&#23384;&#21306;buf&#20013;</span>

<span style="color: #ffa07a;">   filedes&#65306;&#25991;&#20214;&#25551;&#36848;&#31526;</span>
<span style="color: #ffa07a;">   buf&#65306;&#32531;&#23384;&#21306;&#25351;&#38024;</span>
<span style="color: #ffa07a;">   nbytes&#65306;&#35835;&#21462;&#30340;&#23383;&#33410;&#25968;&#30446;</span>

<span style="color: #ffa07a;">   &#36820;&#22238;&#20540;&#65306;&#27491;&#25968;&#34920;&#31034;&#35835;&#21462;&#30340;&#30495;&#23454;&#23383;&#33410;&#25968;</span>
<span style="color: #ffa07a;">   &#12288;&#12288;&#12288;&#12288;0&#34920;&#31034;&#35835;&#21462;&#21040;EOF</span>
<span style="color: #ffa07a;">      -1&#34920;&#31034;&#20986;&#38169;&#65292;&#24182;&#35774;&#32622;errorno</span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">ssize_t</span> <span style="color: #87cefa;">read</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">filedes</span>, <span style="color: #98fb98;">void</span> *<span style="color: #eedd82;">buf</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">nbytes</span>);
</pre>
</div>

<p>
有多种情况可使实际读到的字节数少于要求读字节数：
</p>
<ul class="org-ul">
<li>读普通文件时，在读到要求字节数之前已到达了文件尾端。例如若在到达文件尾端之前还有30个字节，而要求读100个字节，则read返回30。下一次再调用read，它将返回0(文件尾端)
</li>
<li>当从终端设备读时，通常一次最多读一行
</li>
<li>当从网络读时，网络中的缓冲机构可能造成返回值小于所要求读的字节数
</li>
<li>某些面向记录的设备，例如磁带，一次最多返回一个记录
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">write函数</h2>
<div class="outline-text-2" id="text-7">
<p>
向打开的文件写数据
</p>

<p>
对于普通文件写操作从文件的当前位移量处开始。如果在打开该文件时指定了O_APPEND选择项，则在每次写操作之前，将文件位移量设置在文件的当前结尾处。在一次成功写之后，该文件位移量增加实际写的字节数
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;unistd.h&gt;</span>
<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#25353;&#25351;&#23450;&#30340;&#23383;&#33410;&#25968;nbytes&#20174;buf&#22788;&#21462;&#25968;&#25454;&#65292;&#36755;&#20986;&#21040;&#25991;&#20214;filedes&#30340;&#24403;&#21069;&#20301;&#32622;&#22788;&#65292;&#22914;&#26524;&#24050;&#32463;&#21040;&#25991;&#20214;&#26411;</span>
<span style="color: #ffa07a;">&#23614;,&#23558;&#22686;&#21152;&#25991;&#20214;&#38271;&#24230;&#24182;&#22312;&#26368;&#21518;&#28155;&#21152;EOF&#26631;&#24535;</span>

<span style="color: #ffa07a;">   filedes&#65306;&#25991;&#20214;&#25551;&#36848;&#31526;</span>
<span style="color: #ffa07a;">   buf&#65306;&#23383;&#31526;&#32531;&#23384;&#21306;&#25351;&#38024;</span>
<span style="color: #ffa07a;">   nbytes&#65306;&#20889;&#20837;&#25968;&#25454;&#23383;&#33410;&#25968;</span>

<span style="color: #ffa07a;">   &#36820;&#22238;&#20540;:&#12288;&#20026;&#27491;&#25968;&#26102;&#34920;&#31034;&#30495;&#23454;&#20889;&#20837;&#30340;&#23383;&#33410;&#25968;,</span>
<span style="color: #ffa07a;">       &#20986;&#38169;&#36820;&#22238;-1&#65292;&#21516;&#26102;errno&#34987;&#35774;&#32622;</span>
<span style="color: #ffa07a;"> */</span>
<span style="color: #98fb98;">ssize_t</span> <span style="color: #87cefa;">write</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">filedes</span>, <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span> *<span style="color: #eedd82;">buf</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">nbytes</span>);
</pre>
</div>
<p>
write出错的常见原因是:
</p>
<ul class="org-ul">
<li>磁盘已写满
</li>
<li>超过了对一个给定进程的文件长度限制
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">I/O的效率</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: klose</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
